<template>
  <div id="chat-msg" >
    <ChatHeader :name="id"></ChatHeader>
    <div class="chat_msg_body">
      <vue-scroll :ops="ops">
        <!-- 每一个聊天气泡 -->
        <div class="chat_msg_box">
          <span class="msg_from">黄豆黄</span>
          <div class="msg_content">
            <p>
              欲言国之老少，请先言人之老少。老年人常思既往，少年人常思将来
              《饮冰室合集》 《饮冰室合集》
              。惟思既往也，故生留恋心；惟思将来也，故生希望心。惟留恋也，故保守；惟希望也，故进取。惟保守也，故永旧；惟进取也，故日新。惟思既往也，事事皆其所已经者，故惟知照例；惟思将来也，事事皆其所未经者，故常敢破格。老年人常多忧虑，少年人常好行乐。惟多忧也，故灰心；惟行乐也，故盛气。惟灰心也，故怯懦；惟盛气也，故豪壮。惟怯懦也，故苟且；惟豪壮也，故冒险。惟苟且也，故能灭世界；惟冒险也，故能造世界。老年人常厌事，少年人常喜事。惟厌事也，故常觉一切事无可为者；惟好事也，故常觉一切事无不可为者。老年人如夕照，少年人如朝阳；老年人如瘠牛，少年人如乳虎。老年人如僧，少年人如侠。老年人如字典，少年人如戏文。老年人如鸦片烟，少年人如泼兰地酒。老年人如别行星之陨石，少年人如大洋海之珊瑚岛。老年人如埃及沙漠之金字塔（4），少年人如西比利亚（5）之铁路；老年人如秋后之柳，少年人如春前之草。老年人如死海（6）之潴为泽，少年人如长江之初发源。此老年与少年性格不同之大略也。任公曰：人固有之，国亦宜然。
            </p>
          </div>
          <span class="msg_time">2020-12:08</span>
        </div>
        <div class="chat_msg_box">
          <span class="msg_from">黄豆黄</span>
          <div class="msg_content">
            <p>
              欲言国之老少，请先言人之老少。老年人常思既往，少年人常思将来
              《饮冰室合集》 《饮冰室合集》
              。惟思既往也，故生留恋心；惟思将来也，故生希望心。惟留恋也，故保守；惟希望也，故进取。惟保守也，故永旧；惟进取也，故日新。惟思既往也，事事皆其所已经者，故惟知照例；惟思将来也，事事皆其所未经者，故常敢破格。老年人常多忧虑，少年人常好行乐。惟多忧也，故灰心；惟行乐也，故盛气。惟灰心也，故怯懦；惟盛气也，故豪壮。惟怯懦也，故苟且；惟豪壮也，故冒险。惟苟且也，故能灭世界；惟冒险也，故能造世界。老年人常厌事，少年人常喜事。惟厌事也，故常觉一切事无可为者；惟好事也，故常觉一切事无不可为者。老年人如夕照，少年人如朝阳；老年人如瘠牛，少年人如乳虎。老年人如僧，少年人如侠。老年人如字典，少年人如戏文。老年人如鸦片烟，少年人如泼兰地酒。老年人如别行星之陨石，少年人如大洋海之珊瑚岛。老年人如埃及沙漠之金字塔（4），少年人如西比利亚（5）之铁路；老年人如秋后之柳，少年人如春前之草。老年人如死海（6）之潴为泽，少年人如长江之初发源。此老年与少年性格不同之大略也。任公曰：人固有之，国亦宜然。
            </p>
          </div>
          <span class="msg_time">12:08</span>
        </div>
        <div class="chat_msg_box">
          <span class="msg_from">黄豆黄</span>
          <div class="msg_content">
            <p>
              欲言国之老少，请先言人之老少。老年人常思既往，少年人常思将来
              《饮冰室合集》 《饮冰室合集》
              。惟思既往也，故生留恋心；惟思将来也，故生希望心。惟留恋也，故保守；惟希望也，故进取。惟保守也，故永旧；惟进取也，故日新。惟思既往也，事事皆其所已经者，故惟知照例；惟思将来也，事事皆其所未经者，故常敢破格。老年人常多忧虑，少年人常好行乐。惟多忧也，故灰心；惟行乐也，故盛气。惟灰心也，故怯懦；惟盛气也，故豪壮。惟怯懦也，故苟且；惟豪壮也，故冒险。惟苟且也，故能灭世界；惟冒险也，故能造世界。老年人常厌事，少年人常喜事。惟厌事也，故常觉一切事无可为者；惟好事也，故常觉一切事无不可为者。老年人如夕照，少年人如朝阳；老年人如瘠牛，少年人如乳虎。老年人如僧，少年人如侠。老年人如字典，少年人如戏文。老年人如鸦片烟，少年人如泼兰地酒。老年人如别行星之陨石，少年人如大洋海之珊瑚岛。老年人如埃及沙漠之金字塔（4），少年人如西比利亚（5）之铁路；老年人如秋后之柳，少年人如春前之草。老年人如死海（6）之潴为泽，少年人如长江之初发源。此老年与少年性格不同之大略也。任公曰：人固有之，国亦宜然。
            </p>
          </div>
          <span class="msg_time">12:08</span>
        </div>
        <div class="chat_msg_box">
          <span class="msg_from">黄豆黄</span>
          <div class="msg_content">
            <p>
              欲言国之老少，请先言人之老少。老年人常思既往，少年人常思将来
              《饮冰室合集》 《饮冰室合集》
              。惟思既往也，故生留恋心；惟思将来也，故生希望心。惟留恋也，故保守；惟希望也，故进取。惟保守也，故永旧；惟进取也，故日新。惟思既往也，事事皆其所已经者，故惟知照例；惟思将来也，事事皆其所未经者，故常敢破格。老年人常多忧虑，少年人常好行乐。惟多忧也，故灰心；惟行乐也，故盛气。惟灰心也，故怯懦；惟盛气也，故豪壮。惟怯懦也，故苟且；惟豪壮也，故冒险。惟苟且也，故能灭世界；惟冒险也，故能造世界。老年人常厌事，少年人常喜事。惟厌事也，故常觉一切事无可为者；惟好事也，故常觉一切事无不可为者。老年人如夕照，少年人如朝阳；老年人如瘠牛，少年人如乳虎。老年人如僧，少年人如侠。老年人如字典，少年人如戏文。老年人如鸦片烟，少年人如泼兰地酒。老年人如别行星之陨石，少年人如大洋海之珊瑚岛。老年人如埃及沙漠之金字塔（4），少年人如西比利亚（5）之铁路；老年人如秋后之柳，少年人如春前之草。老年人如死海（6）之潴为泽，少年人如长江之初发源。此老年与少年性格不同之大略也。任公曰：人固有之，国亦宜然。
            </p>
          </div>
          <span class="msg_time">12:08</span>
        </div>
      </vue-scroll>
    </div>
  </div>
</template>
<script>
import "./chat_content.scss"
import Ops from "@/utils/scrollConfig"
import ChatHeader from "@/components/chat_frame/chat_header/chat_header"
export default {
  data() {
    return {
      ops: Ops,
      show: false,
      id: this.$route.params.id //将ID传给header组件。
    }
  },
  props: {
  },
  components: {
    ChatHeader
  }
}
</script>
